app/controllers/map_controller.rb

  def login
    @user = params[:user]
    @pass = params[:pass]

    #logx("login: #{@use}|#{@pass}")
    u = User.find_by_user_id(@user)
---
SELECT * FROM "users" WHERE ("users"."user_id" = E'3401') LIMIT 1

  def show
    id = params[:id]
    pcode = id[0..1]
    acode = id[2..3]
    @ampcode = ''
    @ampname = ''
    @ampbound = ''
    if (id != 'Invalid')
      a = Amphoe.find(:first,:select=>'amp_name',
        :conditions => "amp_pcode = '#{pcode}' AND amp_code = '#{acode}' ")
      @ampname = a.amp_name
      @ampcode = pcode << acode
      b = Extent.find(:first, :conditions=> "code = '#{@ampcode}'")
---
SELECT amp_name FROM "amphoes" WHERE (amp_pcode = '34' AND amp_code = '02' ) LIMIT 1
SELECT * FROM "extents" WHERE (code = '3402') LIMIT 1

  def showx
    lacode = params[:id]
    ampcode = Ladmin.find_by_sql(["SELECT la_pcode || la_acode as acode FROM ladmins WHERE la_code = ?", lacode])
    id = ampcode[0].acode
    pcode = id[0..1]
    acode = id[2..3]

    @ampcode = ''
    @ampname = ''
    @ampbound = ''
    if (id != 'Invalid')
      a = Amphoe.find(:first,:select=>'amp_name',
        :conditions => "amp_pcode = '#{pcode}' AND amp_code = '#{acode}' ")
      @ampname = a.amp_name
      @ampcode = pcode << acode
      b = Extent.find(:first, :conditions=> "code = '#{@ampcode}'")
---
SELECT amp_name FROM "amphoes" WHERE (amp_pcode = '#<Ladmin:0xb6d1b1e8>' AND amp_code = '' ) LIMIT 1
SELECT * FROM "extents" WHERE (code = '3402') LIMIT 1

  def get_tamcode
    ampcode = params[:ampcode]
    pcode = ampcode[0..1]
    acode = ampcode[2..3]
    @tam = Tambon.find(:all,:select=>'id,tam_code,tam_name',
      :conditions=>"tam_pcode='#{pcode}' AND tam_acode='#{acode}'")
---
SELECT id,tam_code,tam_name FROM "tambons" WHERE (tam_pcode='34' AND tam_acode='01')

  def get_lacode
    ampcode = params[:ampcode]
    pcode = ampcode[0..1]
    acode = ampcode[2..3]
    @la = Ladmin.find(:all,:select=>'id,la_code,la_name',
      :conditions=>"la_pcode='#{pcode}' AND la_acode='#{acode}'" )
---
SELECT id,la_code,la_name FROM "ladmins" WHERE (la_pcode='34' AND la_acode='01')

  def get_lacodemon
    ampcode = params[:ampcode]
    pcode = ampcode[0..1]
    acode = ampcode[2..3]
    @la = Ladmin.find(:all,:select=>'id,la_code,la_name',
      :conditions=>"la_pcode='#{pcode}' AND la_acode='#{acode}' AND the_geom IS NOT NULL" )
---
SELECT id,la_code,la_name FROM "ladmins" WHERE (la_pcode='34' AND la_acode='01' AND the_geom IS NOT NULL)

  def tamRowSelect
    id = params[:id]
    t = Tambon.find(id)
---
SELECT * FROM "tambons" WHERE ("tambons"."id" = 9470)

  def add_hotspot
    id = params[:hot_loc_id]
    code = params[:hotcode]
    desc = params[:hot_description]
    geometry = GeoRuby::SimpleFeatures::Geometry.from_ewkt(params[:hot_geometry])
    geometry.srid = 4326

    # Insert this new hotspot to table locations
    loc = Location.create(:loc_code => code, :loc_desc => desc, :the_geom => geometry)
---
INSERT INTO "locations" ("loc_code", "the_geom", "loc_desc") VALUES(2, '0101000020E610000066666616C12B5A40643BDF4FD0CC2E40', E'Snooker 1234') RETURNING "id"

  def hot_delete
    id = params[:id]
    loc = Location.find(id)
    if (loc.delete)
---
SELECT * FROM "locations" WHERE ("locations"."id" = 749)
DELETE FROM "locations" WHERE ("id" IN (749))